In [36]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%sql postgresql://udacity:udacity@postgres/sparkifydb

In [34]:
# %sql truncate table songplays;

 * postgresql://udacity:***@postgres/sparkifydb
Done.

[]

In [45]:
%sql SELECT * FROM songplays LIMIT 15;

 * postgresql://udacity:***@postgres/sparkifydb
15 rows affected.

[(74, datetime.datetime(2018, 11, 11, 2, 33, 56, 796000), 69, 'free', None, None, 455, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (75, datetime.datetime(2018, 11, 11, 2, 36, 10, 796000), 69, 'free', None, None, 455, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (76, datetime.datetime(2018, 11, 11, 2, 40, 34, 796000), 69, 'free', None, None, 455, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (77, datetime.datetime(2018, 11, 11, 4, 36, 13, 796000), 32, 'free', None, None, 456, '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (78, datetime.datetime(2018, 11, 11, 4, 36, 46, 796000), 75, 'free', None, None, 284, '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_3) AppleWebKit/537.75.14 (KHTML, like Gecko) Version/7.0.3 Safari/537.75.14"'),
 (79, datetime.datetime(2018, 11, 11, 9, 56, 28, 796000), 92, 'free', None, None, 328, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (80, datetime.datetime(2018, 11, 11, 10, 0, 47, 796000), 92, 'free', None, None, 328, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (81, datetime.datetime(2018, 11, 11, 10, 4, 7, 796000), 92, 'free', None, None, 328, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (82, datetime.datetime(2018, 11, 11, 10, 8, 28, 796000), 92, 'free', None, None, 328, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (83, datetime.datetime(2018, 11, 11, 10, 12, 0, 796000), 92, 'free', None, None, 328, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (84, datetime.datetime(2018, 11, 11, 10, 27, 43, 796000), 49, 'free', None, None, 437, 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (85, datetime.datetime(2018, 11, 11, 10, 33, 44, 796000), 49, 'free', None, None, 437, 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (86, datetime.datetime(2018, 11, 11, 10, 36, 22, 796000), 49, 'free', None, None, 437, 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (87, datetime.datetime(2018, 11, 11, 10, 40, 14, 796000), 49, 'free', None, None, 437, 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (88, datetime.datetime(2018, 11, 11, 10, 43, 23, 796000), 49, 'free', None, None, 437, 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0')]

In [12]:
%sql CREATE UNIQUE INDEX asdf ON users(user_id);

 * postgresql://udacity:***@postgres/sparkifydb
Done.

[]

In [40]:
%sql SELECT * FROM users LIMIT 15;

 * postgresql://udacity:***@postgres/sparkifydb
15 rows affected.

[(69, 'Anabelle', 'Simpson', 'F', 'free'),
 (32, 'Lily', 'Burns', 'F', 'free'),
 (75, 'Joseph', 'Gutierrez', 'M', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free'),
 (88, 'Mohammad', 'Rodriguez', 'M', 'free'),
 (96, 'Cierra', 'Finley', 'F', 'free'),
 (44, 'Aleena', 'Kirby', 'F', 'paid'),
 (67, 'Colm', 'Santana', 'M', 'free'),
 (62, 'Connar', 'Moreno', 'M', 'free'),
 (14, 'Theodore', 'Harris', 'M', 'free'),
 (16, 'Rylan', 'George', 'M', 'free'),
 (80, 'Tegan', 'Levine', 'F', 'paid'),
 (35, 'Molly', 'Taylor', 'F', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [39]:
%sql SELECT * FROM songs LIMIT 15;

 * postgresql://udacity:***@postgres/sparkifydb
1 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, Decimal('233.40363'))]

In [ ]:
# %sql SELECT s.song_id, a.artist_id from songs s join artists a ON s.artist_id = a.artist_id WHERE LOWER(s.title) LIKE LOWER('Something Girls') AND LOWER(a.name) LIKE LOWER('Adam Ant') AND ROUND(s.duration, 3) = ROUND(233.40363, 3);

In [37]:
%sql SELECT * FROM artists LIMIT 15;

 * postgresql://udacity:***@postgres/sparkifydb
1 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', None, None)]

In [9]:
# %sql truncate table time;

 * postgresql://udacity:***@postgres/sparkifydb
Done.

[]

In [44]:
%sql SELECT * FROM time limit 15;

 * postgresql://udacity:***@postgres/sparkifydb
15 rows affected.

[(datetime.datetime(2018, 11, 11, 2, 33, 56, 796000), 2, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 2, 36, 10, 796000), 2, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 2, 40, 34, 796000), 2, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 4, 36, 13, 796000), 4, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 4, 36, 46, 796000), 4, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 9, 56, 28, 796000), 9, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 0, 47, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 4, 7, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 8, 28, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 12, 0, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 27, 43, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 33, 44, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 36, 22, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 40, 14, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 43, 23, 796000), 10, 11, 45, 11, 2018, 6)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).